DWARF for correlation.c
DIE    0: DW_TAG_compile_unit (0x7fc43270c0a0)
  abbrev id: 0 offset: 0 mark: 0
  DW_AT_producer: "GNU C17 9.4.0 -mtune=generic -march=x86-64 -g -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection"
  DW_AT_language: 12
  DW_AT_name: "correlation.c"
  DW_AT_comp_dir: "/home/ronaldo/Documents/ML-MC-Model/gcc-polybench/datamining/correlation"
    DIE    0: DW_TAG_typedef (0x7fc432845870)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "size_t"
      DW_AT_decl_file: "/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h" (0)
      DW_AT_decl_line: 209
      DW_AT_decl_column: 23
      DW_AT_type: die -> 0 (0x7fc4328458c0)
    DIE    0: DW_TAG_base_type (0x7fc4328458c0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_encoding: 7
      DW_AT_name: "long unsigned int"
    DIE    0: DW_TAG_base_type (0x7fc432846a00)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_encoding: 7
      DW_AT_name: "unsigned int"
    DIE    0: DW_TAG_pointer_type (0x7fc432846af0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
    DIE    0: DW_TAG_base_type (0x7fc432847460)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 1
      DW_AT_encoding: 8
      DW_AT_name: "unsigned char"
    DIE    0: DW_TAG_base_type (0x7fc432847550)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 2
      DW_AT_encoding: 7
      DW_AT_name: "short unsigned int"
    DIE    0: DW_TAG_base_type (0x7fc432847780)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 1
      DW_AT_encoding: 6
      DW_AT_name: "signed char"
    DIE    0: DW_TAG_base_type (0x7fc432847910)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 2
      DW_AT_encoding: 5
      DW_AT_name: "short int"
    DIE    0: DW_TAG_base_type (0x7fc432847aa0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 4
      DW_AT_encoding: 5
      DW_AT_name: "int"
    DIE    0: DW_TAG_base_type (0x7fc432847c30)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_encoding: 5
      DW_AT_name: "long int"
    DIE    0: DW_TAG_typedef (0x7fc43284fb90)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "__off_t"
      DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types.h" (0)
      DW_AT_decl_line: 152
      DW_AT_decl_column: 25
      DW_AT_type: die -> 0 (0x7fc432847c30)
    DIE    0: DW_TAG_typedef (0x7fc43284fc30)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "__off64_t"
      DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types.h" (0)
      DW_AT_decl_line: 153
      DW_AT_decl_column: 27
      DW_AT_type: die -> 0 (0x7fc432847c30)
    DIE    0: DW_TAG_pointer_type (0x7fc432855e10)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc432855e60)
    DIE    0: DW_TAG_base_type (0x7fc432855e60)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 1
      DW_AT_encoding: 6
      DW_AT_name: "char"
    DIE    0: DW_TAG_const_type (0x7fc43287ce10)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7fc432855e60)
    DIE    0: DW_TAG_structure_type (0x7fc43285ac30)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "_IO_FILE"
      DW_AT_byte_size: 216
      DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
      DW_AT_decl_line: 49
      DW_AT_decl_column: 8
        DIE    0: DW_TAG_member (0x7fc43285e9b0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_flags"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 51
          DW_AT_decl_column: 7
          DW_AT_type: die -> 0 (0x7fc432847aa0)
          DW_AT_data_member_location: 0
        DIE    0: DW_TAG_member (0x7fc43285ea00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_read_ptr"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 54
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 8
        DIE    0: DW_TAG_member (0x7fc43285ea50)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_read_end"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 55
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 16
        DIE    0: DW_TAG_member (0x7fc43285eaa0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_read_base"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 56
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 24
        DIE    0: DW_TAG_member (0x7fc43285eaf0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_write_base"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 57
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 32
        DIE    0: DW_TAG_member (0x7fc43285eb40)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_write_ptr"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 58
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 40
        DIE    0: DW_TAG_member (0x7fc43285eb90)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_write_end"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 59
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 48
        DIE    0: DW_TAG_member (0x7fc43285ebe0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_buf_base"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 60
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 56
        DIE    0: DW_TAG_member (0x7fc43285ec30)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_buf_end"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 61
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 64
        DIE    0: DW_TAG_member (0x7fc43285ec80)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_save_base"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 64
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 72
        DIE    0: DW_TAG_member (0x7fc43285ecd0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_backup_base"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 65
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 80
        DIE    0: DW_TAG_member (0x7fc43285ed20)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_IO_save_end"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 66
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432855e10)
          DW_AT_data_member_location: 88
        DIE    0: DW_TAG_member (0x7fc43285edc0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_markers"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 68
          DW_AT_decl_column: 22
          DW_AT_type: die -> 0 (0x7fc43285ee10)
          DW_AT_data_member_location: 96
        DIE    0: DW_TAG_member (0x7fc43285ee60)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_chain"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 70
          DW_AT_decl_column: 20
          DW_AT_type: die -> 0 (0x7fc43285eeb0)
          DW_AT_data_member_location: 104
        DIE    0: DW_TAG_member (0x7fc43285ef00)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_fileno"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 72
          DW_AT_decl_column: 7
          DW_AT_type: die -> 0 (0x7fc432847aa0)
          DW_AT_data_member_location: 112
        DIE    0: DW_TAG_member (0x7fc43285ef50)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_flags2"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 73
          DW_AT_decl_column: 7
          DW_AT_type: die -> 0 (0x7fc432847aa0)
          DW_AT_data_member_location: 116
        DIE    0: DW_TAG_member (0x7fc43285efa0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_old_offset"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 74
          DW_AT_decl_column: 11
          DW_AT_type: die -> 0 (0x7fc43284fb90)
          DW_AT_data_member_location: 120
        DIE    0: DW_TAG_member (0x7fc432865000)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_cur_column"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 77
          DW_AT_decl_column: 18
          DW_AT_type: die -> 0 (0x7fc432847550)
          DW_AT_data_member_location: 128
        DIE    0: DW_TAG_member (0x7fc432865050)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_vtable_offset"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 78
          DW_AT_decl_column: 15
          DW_AT_type: die -> 0 (0x7fc432847780)
          DW_AT_data_member_location: 130
        DIE    0: DW_TAG_member (0x7fc432865140)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_shortbuf"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 79
          DW_AT_decl_column: 8
          DW_AT_type: die -> 0 (0x7fc4328650a0)
          DW_AT_data_member_location: 131
        DIE    0: DW_TAG_member (0x7fc432865190)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_lock"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 81
          DW_AT_decl_column: 15
          DW_AT_type: die -> 0 (0x7fc4328651e0)
          DW_AT_data_member_location: 136
        DIE    0: DW_TAG_member (0x7fc432865230)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_offset"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 89
          DW_AT_decl_column: 13
          DW_AT_type: die -> 0 (0x7fc43284fc30)
          DW_AT_data_member_location: 144
        DIE    0: DW_TAG_member (0x7fc4328652d0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_codecvt"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 91
          DW_AT_decl_column: 23
          DW_AT_type: die -> 0 (0x7fc432865320)
          DW_AT_data_member_location: 152
        DIE    0: DW_TAG_member (0x7fc4328653c0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_wide_data"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 92
          DW_AT_decl_column: 25
          DW_AT_type: die -> 0 (0x7fc432865410)
          DW_AT_data_member_location: 160
        DIE    0: DW_TAG_member (0x7fc432865460)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_freeres_list"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 93
          DW_AT_decl_column: 20
          DW_AT_type: die -> 0 (0x7fc43285eeb0)
          DW_AT_data_member_location: 168
        DIE    0: DW_TAG_member (0x7fc4328654b0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_freeres_buf"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 94
          DW_AT_decl_column: 9
          DW_AT_type: die -> 0 (0x7fc432846af0)
          DW_AT_data_member_location: 176
        DIE    0: DW_TAG_member (0x7fc432865500)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "__pad5"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 95
          DW_AT_decl_column: 10
          DW_AT_type: die -> 0 (0x7fc432845870)
          DW_AT_data_member_location: 184
        DIE    0: DW_TAG_member (0x7fc432865550)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_mode"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 96
          DW_AT_decl_column: 7
          DW_AT_type: die -> 0 (0x7fc432847aa0)
          DW_AT_data_member_location: 192
        DIE    0: DW_TAG_member (0x7fc432865640)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_name: "_unused2"
          DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
          DW_AT_decl_line: 98
          DW_AT_decl_column: 8
          DW_AT_type: die -> 0 (0x7fc4328655a0)
          DW_AT_data_member_location: 196
    DIE    0: DW_TAG_typedef (0x7fc43285ad20)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "FILE"
      DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h" (0)
      DW_AT_decl_line: 7
      DW_AT_decl_column: 25
      DW_AT_type: die -> 0 (0x7fc43285ac30)
    DIE    0: DW_TAG_typedef (0x7fc43285afa0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "_IO_lock_t"
      DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h" (0)
      DW_AT_decl_line: 43
      DW_AT_decl_column: 14
    DIE    0: DW_TAG_structure_type (0x7fc43285ed70)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "_IO_marker"
      DW_AT_declaration: 1
    DIE    0: DW_TAG_pointer_type (0x7fc43285ee10)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc43285ed70)
    DIE    0: DW_TAG_pointer_type (0x7fc43285eeb0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc43285ac30)
    DIE    0: DW_TAG_array_type (0x7fc4328650a0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7fc432855e60)
        DIE    0: DW_TAG_subrange_type (0x7fc4328650f0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7fc4328458c0)
          DW_AT_upper_bound: 0
    DIE    0: DW_TAG_pointer_type (0x7fc4328651e0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc43285afa0)
    DIE    0: DW_TAG_structure_type (0x7fc432865280)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "_IO_codecvt"
      DW_AT_declaration: 1
    DIE    0: DW_TAG_pointer_type (0x7fc432865320)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc432865280)
    DIE    0: DW_TAG_structure_type (0x7fc432865370)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "_IO_wide_data"
      DW_AT_declaration: 1
    DIE    0: DW_TAG_pointer_type (0x7fc432865410)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc432865370)
    DIE    0: DW_TAG_array_type (0x7fc4328655a0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7fc432855e60)
        DIE    0: DW_TAG_subrange_type (0x7fc4328655f0)
          abbrev id: 0 offset: 0 mark: 0
          DW_AT_type: die -> 0 (0x7fc4328458c0)
          DW_AT_upper_bound: 19
    DIE    0: DW_TAG_variable (0x7fc43286a370)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "stdin"
      DW_AT_decl_file: "/usr/include/stdio.h" (0)
      DW_AT_decl_line: 137
      DW_AT_decl_column: 14
      DW_AT_type: die -> 0 (0x7fc43286a3c0)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_pointer_type (0x7fc43286a3c0)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_byte_size: 8
      DW_AT_type: die -> 0 (0x7fc43285ad20)
    DIE    0: DW_TAG_variable (0x7fc43286a460)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "stdout"
      DW_AT_decl_file: "/usr/include/stdio.h" (0)
      DW_AT_decl_line: 138
      DW_AT_decl_column: 14
      DW_AT_type: die -> 0 (0x7fc43286a3c0)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_variable (0x7fc43286a500)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "stderr"
      DW_AT_decl_file: "/usr/include/stdio.h" (0)
      DW_AT_decl_line: 139
      DW_AT_decl_column: 14
      DW_AT_type: die -> 0 (0x7fc43286a3c0)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_variable (0x7fc43287cc80)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_name: "sys_nerr"
      DW_AT_decl_file: "/usr/include/x86_64-linux-gnu/bits/sys_errlist.h" (0)
      DW_AT_decl_line: 26
      DW_AT_decl_column: 12
      DW_AT_type: die -> 0 (0x7fc432847aa0)
      DW_AT_external: 1
      DW_AT_declaration: 1
    DIE    0: DW_TAG_array_type (0x7fc43287cd20)
      abbrev id: 0 offset: 0 mark: 0
      DW_AT_type: die -> 0 (0x7fc43287ce60)
